package days02;

/**
 * @author jinseong
 * @date 2024. 1. 2. - 오후 4:47:11
 * @subject
 * @content	
 */

public class Ex11 {

	public static void main(String[] args) {
		
		// 실수형 : float, double
		float f; // [부호비트 1][8비트 지수(E) 1000 0010][23rktn][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][]
		double d; // [부호비트 1][11비트 지수(E)][52가수][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][] [][][][][][][][]
		
		// [9.1234567] 10진수 실수 - 2진수 실수 변환 -> 정규화 -> 저장
		// 1001.~~~ (무한실수)
		// 정규화(부동소수점)
		// 1.001~~~~~~~~~~~~~ * 2^3 (무한실수)
		//	 가수(M)			지수(E) = 127 + 3 = 130
		
	} 

}
